In [2]:
import sqlite3 as sq

## Create the database

In [3]:
database =sq.connect("test.db")
print("Database successful created")

Database successful created

## perform query

CREATE TABLE Table_name(
    Name char(100),
    Age int
);

## create table in database

In [4]:
database.execute(
'''CREATE TABLE Table_name(
    Name char(100),
    Age int
);''')


print("Table created")

Table created

In [8]:
database.execute("INSERT INTO Table_name VALUES('smith',25);")
database.execute("INSERT INTO Table_name VALUES('Devansh',12);")
database.execute("INSERT INTO Table_name VALUES('Parikh',36);")

print("Data has been inserted ")

Data has been inserted

In [10]:
data=database.execute("SELECT * FROM Table_name;")

In [11]:
for i in data:
    print(i)

('smith', 25)
('Devansh', 12)
('Parikh', 36)